# Get Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
InternalOrigin..::..Get Method
InternalOrigin Class See Also
---
Gets the internal origin for the document.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2020.2
# Syntax
C#
---
```text
public static InternalOrigin Get(
	Document document
)
```

Visual Basic
---
```text
Public Shared Function Get ( _
	document As Document _
) As InternalOrigin
```

Visual C++
---
```text
public:
static InternalOrigin^ Get(
	Document^ document
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document Revit document from which to get the internal origin.
# ### Return Value
The internal origin of the document.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
InternalOrigin Class
Autodesk.Revit.DB Namespace